Autodesk.Revit.DB.PointClouds.PointCloudColorEncoding
Since:
2012
The color encodings supported by Revit point clouds.
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCloudColorEncoding.ABGR
The point cloud uses colors arranged in ABGR format (common in Windows).

Autodesk.Revit.DB.PointClouds.PointCloudColorEncoding.ARGB
The point cloud uses colors arranged in ARGB format.